trade_exp/src/Documents/ПересчетТоваров/ПересчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПересчетТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЯчейкаКонсолидацииИзлишковТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БлокироватьЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПечататьКоличествоПоУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОтдельнуюЯчейкуИзлишков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЯчейкаКонсолидацииИспорченныхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОтдельнуюЯчейкуПорчи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧленКомиссии1</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧленКомиссии2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧленКомиссии3</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсполнительСотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="040754a8-2dde-4072-bfa3-9c51e0ca7cd2">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e632e4d1-fe18-4e14-b8a6-113c60649561">
    <name>ПодтвержденОтделомКачества</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7c71b25-2abe-41c9-948d-e18b76eb6d67">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4fbe761-a1cc-429e-bed1-680526320608">
    <name>Просчитано</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02012c23-cfa9-4c37-96f6-66f18b1f54c5">
    <name>ТипПересчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4cfb00e-a468-4140-88dd-d9e5d7a096bd">
    <name>ДатаПодтвержденияСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2a3a09c-4c4f-4ea5-bc3b-5252b19c4ced">
    <name>ДатаПодтвержденияОтделомКачества</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f1365d65-692e-4312-b3b4-18aeb2a5ca57">
    <name>ДолжностьИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c8068b5-e9f5-4b58-912c-433b08083a70">
    <name>ДолжностьСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b5ee26d-88c2-48ad-b701-e631a5e1f49f">
    <name>ОтделСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="609a5325-5e4a-4f9e-ab97-19e64b786547">
    <name>ТочкаПересчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cad28ae1-66cb-4891-bfcb-0c8259769d8a">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6a58a7d-0549-442b-ace1-d1785bda675f">
    <name>УчетСкрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8c7b3b6-6b51-4023-aeaf-d962dc0722a1">
    <name>ВремяНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d36ef11d-27b1-4a3d-b76c-c80a74b649b4">
    <name>ВремяОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf9a4ec4-67f0-49ad-822c-80861431af21">
    <name>НовыйРасчетОтклонения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b8be4401-6630-4e65-8608-174dbf3f7872">
      <name>ИзлишекПорча</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4cf0abf1-81c0-4ce6-87e3-507388705497">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b289217d-159a-431e-884f-ee0f6d4cc0c5">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c6cad3a-61b8-464b-85fb-aadc2599a9fb">
      <name>СчетчикОтображенияВопроса</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c65a4019-c532-43c3-9971-a0da5c94eb79">
      <name>ЯПХ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="800cfc6f-b5e5-4c26-afb9-ad1668d2fd42">
      <name>КоличествоПоУчетуВЗонеХранения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7fc82a4c-1a25-496c-90c4-267893cbfa85">
      <name>Приход</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6681f56f-d334-4dc6-8f05-7d7aab3aeffa">
      <name>Расход</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="615d170a-007d-4c17-9f71-ce5bd793a32e">
      <name>СпособВводаКоличестваТовара</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e9b280c2-3352-461f-8333-98ea82ff1b60">
      <name>Отсканирован</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/СписаниеНедостачТоваров/СписаниеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СписаниеНедостачТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a759476-634c-49ca-98f6-188e8168647e">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b233622f-e90f-48dd-9caf-289bb72dd238">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="80f88656-3c34-46f6-be0d-e204c50e6846">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ПересчетТоваров/Forms/Док_ФормаРасхождений/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Товары = Параметры.Товары.Выгрузить();
	Товары.Свернуть("Номенклатура, Расхождение", "КоличествоУпаковокОтклонение");	
	Пересчет = Параметры.Пересчет;
	СкладПересчета = Параметры.Склад;
	ЗаполнитьТаблицыТоваров(Товары, Пересчет);	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РасхожденийНет = Истина Тогда 
		Сообщить("Расхождений нет");
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыТоваров(Товары, Пересчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Расхождение КАК Расхождение,
	|	Товары.КоличествоУпаковокОтклонение КАК КоличествоУпаковокОтклонение
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Расхождение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеНедостачТоваровТовары.Номенклатура КАК Номенклатура,
	|	СУММА(-СписаниеНедостачТоваровТовары.Количество) КАК КоличествоОформлено
	|ПОМЕСТИТЬ ВТ_Объединение
	|ИЗ
	|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
	|ГДЕ
	|	СписаниеНедостачТоваровТовары.Ссылка.ПересчетТоваров = &Пересчет
	|	И СписаниеНедостачТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеНедостачТоваровТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура,
	|	СУММА(ОприходованиеИзлишковТоваровТовары.Количество)
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
	|ГДЕ
	|	ОприходованиеИзлишковТоваровТовары.Ссылка.ПересчетТоваров = &Пересчет
	|	И ОприходованиеИзлишковТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОприходованиеИзлишковТоваровТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПересортицаТоваровТовары.Номенклатура,
	|	-СУММА(ПересортицаТоваровТовары.Количество)
	|ИЗ
	|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	|ГДЕ
	|	ПересортицаТоваровТовары.Ссылка.ПересчетТоваров = &Пересчет
	|	И ПересортицаТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПересортицаТоваровТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПересортицаТоваровТовары.НоменклатураОприходование,
	|	СУММА(ПересортицаТоваровТовары.Количество)
	|ИЗ
	|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	|ГДЕ
	|	ПересортицаТоваровТовары.Ссылка.ПересчетТоваров = &Пересчет
	|	И ПересортицаТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПересортицаТоваровТовары.НоменклатураОприходование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорчаТоваровТовары.Номенклатура,
	|	-СУММА(ПорчаТоваровТовары.Количество)
	|ИЗ
	|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
	|ГДЕ
	|	ПорчаТоваровТовары.Ссылка.ПересчетТоваров = &Пересчет
	|	И ПорчаТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорчаТоваровТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорчаТоваровТовары.НоменклатураОприходование,
	|	СУММА(ПорчаТоваровТовары.Количество)
	|ИЗ
	|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
	|ГДЕ
	|	ПорчаТоваровТовары.Ссылка.ПересчетТоваров = &Пересчет
	|	И ПорчаТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорчаТоваровТовары.НоменклатураОприходование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВТ_Перемещения
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка.ДокументОснование = &Пересчет
	|	И ПеремещениеТоваровТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.КоличествоУпаковокОтклонение КАК КоличествоУпаковокОтклонение,
	|	ЕСТЬNULL(СУММА(ВТ_Объединение.КоличествоОформлено), 0) КАК КоличествоОформлено,
	|	ЕСТЬNULL(ВТ_Перемещения.КоличествоУпаковок, 0) КАК КоличествоУпаковокВПеремещении
	|ПОМЕСТИТЬ ВТ_Соединение
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Объединение КАК ВТ_Объединение
	|		ПО ВТ_Товары.Номенклатура = ВТ_Объединение.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Перемещения КАК ВТ_Перемещения
	|		ПО ВТ_Товары.Номенклатура = ВТ_Перемещения.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.КоличествоУпаковокОтклонение,
	|	ВТ_Товары.Номенклатура,
	|	ЕСТЬNULL(ВТ_Перемещения.КоличествоУпаковок, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Соединение.Номенклатура КАК Номенклатура,
	|	ВТ_Соединение.КоличествоУпаковокОтклонение КАК КоличествоУпаковокОтклонение,
	|	ВТ_Соединение.КоличествоОформлено КАК КоличествоОформлено,
	|	ВТ_Соединение.КоличествоУпаковокВПеремещении КАК КоличествоУпаковокВПеремещении,
	|	ВЫБОР
	|		КОГДА ВТ_Соединение.КоличествоУпаковокОтклонение > 0
	|			ТОГДА ВТ_Соединение.КоличествоУпаковокОтклонение - ВТ_Соединение.КоличествоОформлено - ВТ_Соединение.КоличествоУпаковокВПеремещении
	|		ИНАЧЕ ВТ_Соединение.КоличествоУпаковокОтклонение - ВТ_Соединение.КоличествоОформлено + ВТ_Соединение.КоличествоУпаковокВПеремещении
	|	КОНЕЦ КАК Расхождение,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_ОбщийРезультат
	|ИЗ
	|	ВТ_Соединение КАК ВТ_Соединение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (ВТ_Соединение.Номенклатура = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	ВТ_Соединение.КоличествоУпаковокОтклонение - ВТ_Соединение.КоличествоОформлено <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщийРезультат.Номенклатура КАК Номенклатура,
	|	ВТ_ОбщийРезультат.КоличествоУпаковокОтклонение КАК КоличествоУпаковокОтклонение,
	|	ВТ_ОбщийРезультат.КоличествоОформлено КАК КоличествоОформлено,
	|	ВТ_ОбщийРезультат.Расхождение КАК Расхождение,
	|	ВТ_ОбщийРезультат.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_ОбщийРезультат КАК ВТ_ОбщийРезультат
	|ГДЕ
	|	ВТ_ОбщийРезультат.Расхождение > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщийРезультат.Номенклатура КАК Номенклатура,
	|	ВТ_ОбщийРезультат.КоличествоУпаковокОтклонение КАК КоличествоУпаковокОтклонение,
	|	ВТ_ОбщийРезультат.КоличествоОформлено КАК КоличествоОформлено,
	|	ВТ_ОбщийРезультат.Расхождение КАК Расхождение,
	|	ВТ_ОбщийРезультат.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_ОбщийРезультат КАК ВТ_ОбщийРезультат
	|ГДЕ
	|	ВТ_ОбщийРезультат.Расхождение < 0";
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("Пересчет", Пересчет);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	РезультатИзлишки = ПакетРезультатов[5].Выгрузить();
	Если РезультатИзлишки.Количество()> 0 Тогда 
		ТаблицаИзлишки.Загрузить(РезультатИзлишки);
		Элементы.ТаблицаИзлишек.Видимость = Истина;
	КонецЕсли;

	РезультатНедостачи = ПакетРезультатов[6].Выгрузить();
	Если РезультатНедостачи.Количество()> 0 Тогда 
		ТаблицаНедостачи.Загрузить(РезультатНедостачи); 
		Элементы.ТаблицаНедостачи.Видимость = Истина;
	КонецЕсли;
	
	Если РезультатИзлишки.Количество()= 0 И РезультатНедостачи.Количество()= 0 Тогда
		РасхожденийНет = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещения(Команда)

	СоздатьДокументыПеремещения("Излишки");
	СоздатьДокументыПеремещения("Недостачи");

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПеремещения(Вид)
	
	Если Вид = "Излишки" Тогда
		Товары = ТаблицаИзлишки.Выгрузить();
	Иначе
		Товары = ТаблицаНедостачи.Выгрузить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Расхождение КАК Расхождение,
	|	Товары.Склад КАК Склад,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Расхождение < 0
	|			ТОГДА -ВТ_Товары.Расхождение
	|		ИНАЧЕ ВТ_Товары.Расхождение
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ВТ_Товары.Склад КАК Склад,
	|	ВТ_Товары.ЕдиницаИзмерения КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Расхождение < 0
	|			ТОГДА -ВТ_Товары.Расхождение
	|		ИНАЧЕ ВТ_Товары.Расхождение
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|ИТОГИ ПО
	|	Склад";
	Запрос.УстановитьПараметр("Товары", Товары);
	Результат = Запрос.Выполнить();
	
	ВыборкаСклад = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад");
	Пока ВыборкаСклад.Следующий() Цикл
		ТаблицаТоваров = Новый ТаблицаЗначений();
		ТаблицаТоваров.Колонки.Добавить("Номенклатура");
		ТаблицаТоваров.Колонки.Добавить("КоличествоУпаковок");
		ТаблицаТоваров.Колонки.Добавить("Количество");
		ТаблицаТоваров.Колонки.Добавить("Упаковка");

		ВыборкаТовары = ВыборкаСклад.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			Если ВыборкаТовары.Склад = Справочники.Склады.ПустаяСсылка() Тогда
				Сообщить("Укажите склад для товара " + ВыборкаТовары.Номенклатура);
			Иначе
				СтрокаТаблицы = ТаблицаТоваров.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаТовары);
			КонецЕсли;
		КонецЦикла;
		
		Если ТаблицаТоваров.Количество()> 0 Тогда
			НовыйДокумент = Документы.ПеремещениеТоваров.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.ДокументОснование = Пересчет;
			Если Вид = "Излишки" Тогда
				НовыйДокумент.СкладОтправитель = ВыборкаСклад.Склад;
				НовыйДокумент.СкладПолучатель = СкладПересчета;
			Иначе
				НовыйДокумент.СкладОтправитель = СкладПересчета;
				НовыйДокумент.СкладПолучатель = ВыборкаСклад.Склад;
			КонецЕсли;
			НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
			НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
			НовыйДокумент.Товары.Загрузить(ТаблицаТоваров);
			
			Попытка
				НовыйДокумент.Записать();
			
		   		Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Создан документ " + НовыйДокумент.Ссылка;
				Сообщение.КлючДанных = НовыйДокумент.Ссылка;
				Сообщение.Сообщить();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
